#include "stdafx.h"

/////////WGS84椭球的坐标
C_earth::C_earth()
{

	Re = 6378137;///地球半径
	ff = 1 / 298.257223563;////地球扁率
	Rp = (1 - ff)*Re;
	e = 0.08181919084262;
	wie = 7.292115e-5;///////地球自转角速率
	GM = 3.986004418e14;///宇宙常数
	ge = 9.7803253359;//////////重力加速度
	gp = 9.8321849379;

	////求解地球重力的参数
	beta1 = 0.0053022;
	beta2 = -0.00000582;
	beta3 = 3.0877;
	beta4 = -0.0044;
	beta5 = 0.072e-12;
	beta6 = 8.08e-9;
	//////////////////////

	g0 = ge;
	deg = PI / 180;//////角度
	hour = 3600;////小时
	degh = deg / hour;///度/小时
	degh2 = deg / sqrt(hour);///度/sqrt(小时)
	ug = g0*1e-6;//////微ge
	msh2 = 1 / sqrt(hour);



}